const age = +prompt('рік народження?');


if(1924 < age && age < 2020 && age){
    const city = prompt('в якому місті він живете?');

    if(city == 'Київ' || city == 'Вашингтон' || city == 'Лондон'){
        alert('твій вік ' + (2024 - age) + ' років\n' + 'ти живеш в столиці ' + city);
    }else if(!(city == 'Київ' || city == 'Вашингтон' || city == 'Лондон')){
        alert('твій вік ' + (2024 - age) + ' років\n' + 'ти живеш у місті ' + city);
    }else{
        alert('Шкода, що Ви не захотіли ввести своє місто');
    }
}else{
    alert('Шкода, що Ви не захотіли ввести свій вік');
}

const sport = prompt('улюблений вид спорту?(Бокс, Футбол, Баскетбол)');

switch (sport){
    case 'Бокс':
        alert('Круто! Хочеш стати як Кличко?');
        break;
    case 'Футбол':
        alert('Круто! Хочеш стати як Мессі?');
        break;
    case 'Баскетбол':
        alert('Круто! Хочеш стати як Джордан?');    
        break;
    case null:
        alert('Шкода, що Ви не захотіли ввести вид спорту');
        break;    
    default:
        alert('Шкода шо інший вид спорту');
        break;    
}